# SpatialElementBoundaryOptions Class

---
Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.
SystemObject Autodesk.Revit.DBSpatialElementBoundaryOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SpatialElementBoundaryOptions : IDisposable

    Public Class SpatialElementBoundaryOptions
    	Implements IDisposable

    public ref class SpatialElementBoundaryOptions : IDisposable

    type SpatialElementBoundaryOptions =
        class
            interface IDisposable
        end
The SpatialElementBoundaryOptions type exposes the following members.
| Name| Description
---|---|---
| SpatialElementBoundaryOptions|  Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| SpatialElementBoundaryLocation|  The boundary of spatial element for geometry calculation.
| StoreFreeBoundaryFaces|  Indicates whether to include the free boundary faces in the result.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SpatialElementBoundaryOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace